In [1]:
#series is just like a numpy array. it is built on top of numpy array.can hold any arbitrary python object not only numbers
import numpy as np
import pandas as pd

In [7]:
labels=['a','b','c','d','e']
list1=[1,2,3,4,5]
ar=np.array(list1)
a={'a':1,'b':2,'c':3,'d':4,'e':5}

In [4]:
list1=[1,2,3,4,5]
pd.Series(data=list1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
pd.Series(data=labels, index=list1)    #Series is the inbuilt function. user defined keyword function.

1    a
2    b
3    c
4    d
5    e
dtype: object

In [10]:
pd.Series(data=list1,index=labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
pd.Series(list1,labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
pd.Series(ar,labels)

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [14]:
pd.Series(a)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
#real time we generally create series using numpy arrays only. more than series, dataframes are used. dataframes are a collection of series.

In [15]:
pd.Series(data=labels)
pd.Series([sum,print(len)])

<built-in function len>

0    <built-in function sum>
1                       None
dtype: object

In [16]:
s1=pd.Series([1,2,3,4], index=['USA','Germany','USSR','Japan'])
s1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [17]:
s2=pd.Series([1,2,3,4],index=['USA','Germany','Italy','Japan'])
s2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [19]:
s1['USSR']

3

In [20]:
s1+s2    #adding based on the labels.would add the values if present in both the series

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [21]:
#dataframe
import pandas as pd
import numpy as np

In [49]:
from numpy.random import randn
np.random.seed(100)   #seed function used to initialize random number generator.

In [36]:
a=pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())
a

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [37]:
a['W']

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
E   -0.531280
Name: W, dtype: float64

In [40]:
a[['W','Z']]

          W         Z
A -1.749765 -0.252436
B  0.981321 -1.070043
C -0.189496  0.435163
D -0.583595 -0.104411
E -0.531280 -1.118318

In [42]:
a.W

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
E   -0.531280
Name: W, dtype: float64

In [45]:
a['new']=a['W']+a['Y']
a

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -0.596730
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126
E -0.531280  1.029733 -0.438136 -1.118318 -0.969416

In [50]:
s=('Aditi','Harsh','Ergia','Nupur','Amisha','Dhara')
sub=('Python','PBI','SQL','DM')
a = pd.DataFrame(np.random.randint(50, 101, size=(6, 4)), index=s, columns=sub)
a

        Python  PBI  SQL  DM
Aditi       58   74   53  89
Harsh       73   65   98  60
Ergia       80   84   52  84
Nupur       64   84   99  98
Amisha      74   65   86  93
Dhara       66   59   79  72

In [52]:
#remove a particular column. for dropping a row, axis is optional. but for a column, axis is mandatory.
a.drop('DM',axis=1)

        Python  PBI  SQL
Aditi       58   74   53
Harsh       73   65   98
Ergia       80   84   52
Nupur       64   84   99
Amisha      74   65   86
Dhara       66   59   79

In [53]:
a   #wont change the original df

        Python  PBI  SQL  DM
Aditi       58   74   53  89
Harsh       73   65   98  60
Ergia       80   84   52  84
Nupur       64   84   99  98
Amisha      74   65   86  93
Dhara       66   59   79  72

In [54]:
#selecting rows  loc for names and iloc for index
a.loc['Aditi']

Python    58
PBI       74
SQL       53
DM        89
Name: Aditi, dtype: int32

In [55]:
a.iloc[2]

Python    80
PBI       84
SQL       52
DM        84
Name: Ergia, dtype: int32

In [56]:
#for selecting both rows and columns together
a.loc[['Aditi'],['Python']]

       Python
Aditi      58

In [57]:
a.loc[['Amisha','Ergia'],['Python','SQL']]

        Python  SQL
Amisha      74   86
Ergia       80   52

In [58]:
a.iloc[[2,4],[1,3]]

        PBI  DM
Ergia    84  84
Amisha   65  93

In [59]:
a[a>60]

        Python   PBI   SQL    DM
Aditi      NaN  74.0   NaN  89.0
Harsh     73.0  65.0  98.0   NaN
Ergia     80.0  84.0   NaN  84.0
Nupur     64.0  84.0  99.0  98.0
Amisha    74.0  65.0  86.0  93.0
Dhara     66.0   NaN  79.0  72.0

In [66]:
a[a['Python']>75]['Python']

Ergia    80
Name: Python, dtype: int32

In [72]:
a[(a['DM']>40)&(a['Python']>70)]

        Python  PBI  SQL  DM
Harsh       73   65   98  60
Ergia       80   84   52  84
Amisha      74   65   86  93

In [79]:
a

        Python  PBI  SQL  DM
Aditi       58   74   53  89
Harsh       73   65   98  60
Ergia       80   84   52  84
Nupur       64   84   99  98
Amisha      74   65   86  93
Dhara       66   59   79  72

In [82]:
#hierarchy MULTI INDEXING
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [85]:
b=pd.DataFrame(np.random.randn(6,3),index=hier_index,columns=['A','B','C'])
b

             A         B         C
G1 1  1.377001 -1.187387  0.079393
   2  0.107969  0.506951  1.125589
   3 -1.008052  0.354829 -0.702668
G2 1  0.113451 -1.041134 -0.686599
   2 -2.559448  0.946311  0.790672
   3  0.680002  0.716606  0.477705

In [89]:
b.loc['G2']

          A         B         C
1  0.113451 -1.041134 -0.686599
2 -2.559448  0.946311  0.790672
3  0.680002  0.716606  0.477705

In [90]:
b.iloc[3]

A    0.113451
B   -1.041134
C   -0.686599
Name: (G2, 1), dtype: float64

In [91]:
#if its for columns, use normal brackets. calling one level of index returns the sub dataframe
b.loc['G1'].loc[1]

A    1.377001
B   -1.187387
C    0.079393
Name: 1, dtype: float64

In [95]:
b.index.names=['Group','Num']
b

                  A         B         C
Group Num
G1    1    1.377001 -1.187387  0.079393
      2    0.107969  0.506951  1.125589
      3   -1.008052  0.354829 -0.702668
G2    1    0.113451 -1.041134 -0.686599
      2   -2.559448  0.946311  0.790672
      3    0.680002  0.716606  0.477705

In [96]:
#for getting specific index
b.xs(1,level='Num')

              A         B         C
Group
G1     1.377001 -1.187387  0.079393
G2     0.113451 -1.041134 -0.686599

In [ ]:
#missing data MOST IMP

In [97]:
import numpy as np
import pandas as pd

In [98]:
a=pd.DataFrame({'A':[1,2,np.nan,np.nan],
               'B':[5,np.nan,np.nan,np.nan],
               'C':[1,2,3,np.nan]})
a

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0
3  NaN  NaN  NaN

In [100]:
#for dropping NAN from rows
a.dropna()

     A    B    C
0  1.0  5.0  1.0

In [101]:
#for columns
a.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [102]:
#upto 2 NAN will work
a.dropna(thresh=2)

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0

In [103]:
a.fillna(value='FILL VALUE')

            A           B           C
0         1.0         5.0         1.0
1         2.0  FILL VALUE         2.0
2  FILL VALUE  FILL VALUE         3.0
3  FILL VALUE  FILL VALUE  FILL VALUE

In [105]:
a['A'].fillna(value=a['A'].max())

0    1.0
1    2.0
2    2.0
3    2.0
Name: A, dtype: float64

In [109]:
a['A'].fillna(value=a['A'].mean())

0    1.0
1    2.0
2    1.5
3    1.5
Name: A, dtype: float64

In [118]:
#GROUP BY
data={'Company':['GOOGLE','GOOGLE','MSFT','MSFT','FB','FB'],
'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
      'Sales':[200,120,340,124,243,350],
     'Target':[1,2,3,4,5,6]}
data

{'Company': ['GOOGLE', 'GOOGLE', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350],
 'Target': [1, 2, 3, 4, 5, 6]}

In [119]:
a=pd.DataFrame(data)
a

  Company   Person  Sales  Target
0  GOOGLE      Sam    200       1
1  GOOGLE  Charlie    120       2
2    MSFT      Amy    340       3
3    MSFT  Vanessa    124       4
4      FB     Carl    243       5
5      FB    Sarah    350       6

In [120]:
by_company=a.groupby('Company')
by_company

In [121]:
by_company.mean()

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_4612\2992551274.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_company.mean()

         Sales  Target
Company
FB       296.5     5.5
GOOGLE   160.0     1.5
MSFT     232.0     3.5

In [122]:
by_company.std()

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_4612\1358006188.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_company.std()

              Sales    Target
Company
FB        75.660426  0.707107
GOOGLE    56.568542  0.707107
MSFT     152.735065  0.707107

In [123]:
by_company.max()

          Person  Sales  Target
Company
FB         Sarah    350       6
GOOGLE       Sam    200       2
MSFT     Vanessa    340       4

In [124]:
by_company.describe()

        Sales                                                         Target  \
        count   mean         std    min     25%    50%     75%    max  count
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0    2.0
GOOGLE    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0    2.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0    2.0


        mean       std  min   25%  50%   75%  max
Company
FB       5.5  0.707107  5.0  5.25  5.5  5.75  6.0
GOOGLE   1.5  0.707107  1.0  1.25  1.5  1.75  2.0
MSFT     3.5  0.707107  3.0  3.25  3.5  3.75  4.0

In [125]:
by_company.describe().transpose()['GOOGLE']

Sales   count      2.000000
        mean     160.000000
        std       56.568542
        min      120.000000
        25%      140.000000
        50%      160.000000
        75%      180.000000
        max      200.000000
Target  count      2.000000
        mean       1.500000
        std        0.707107
        min        1.000000
        25%        1.250000
        50%        1.500000
        75%        1.750000
        max        2.000000
Name: GOOGLE, dtype: float64

In [126]:
#merging joining nd concatenating dfs
import pandas as pd

In [128]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']},
                 index=[0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [129]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                 'C':['C4','C5','C6','C7'],
                 'D':['D4','D5','D6','D7']},
                 index=[4,5,6,7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [130]:
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                 'B':['B8','B9','B10','B11'],
                 'C':['C8','C9','C10','C11'],
                 'D':['D8','D9','D10','D11']},
                 index=[8,9,10,11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [131]:
#dimensions should match
pd.concat([df1,df2,df3])
#for columns, axis=1

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [132]:
#use axis for columns, glues vertically
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [134]:
left=pd.DataFrame({'key':['k0','k1','k2','k3'],
                  'a':['a0','a1','a2','a3'],
                  'b':['b0','b1','b2','b3']})
right=pd.DataFrame({'key':['k0','k1','k2','k3'],
                   'c':['c0','c1','c2','c2'],
                   'd':['d0','d1','d2','d3']})

  key   c   d
0  k0  c0  d0
1  k1  c1  d1
2  k2  c2  d2
3  k3  c2  d3

In [135]:
left

  key   a   b
0  k0  a0  b0
1  k1  a1  b1
2  k2  a2  b2
3  k3  a3  b3

In [136]:
right

  key   c   d
0  k0  c0  d0
1  k1  c1  d1
2  k2  c2  d2
3  k3  c2  d3

In [137]:
pd.merge(left,right,how='inner', on='key')

  key   a   b   c   d
0  k0  a0  b0  c0  d0
1  k1  a1  b1  c1  d1
2  k2  a2  b2  c2  d2
3  k3  a3  b3  c2  d3

In [ ]:
#if key is not mentioned, use index instead of key
#df.head(2)=only top 2 records will be shown
#df.unique
#df.nunique
#df.value_count()
#df.apply(user defined function)
#df.apply(len)
#del df(col1)
#df.columns   returns columns names
#df.index    all the labels will be returned
#df.sort_values(by,ascending,descending)
#df.pivot_tables(values,index,columns)
#pd.read_csv()
#